{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "top" : "initializers.onnx_initializer_0",
      "w" : 1,
      "h" : 1,
      "name" : "initializers.onnx_initializer_0",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "initializers.onnx_initializer_0",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "initializers.onnx_initializer_0",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "_neg_y_84",
      "top" : "_neg_y_84",
      "type" : "activation",
      "name" : "_neg_y_84",
      "beta" : 0
    },
    {
      "bottom" : "input_1_1,_neg_y_84",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "84",
      "top" : "84",
      "type" : "elementwise",
      "name" : "84",
      "beta" : 0
    },
    {
      "top" : "initializers.onnx_initializer_1",
      "w" : 1,
      "h" : 1,
      "name" : "initializers.onnx_initializer_1",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "initializers.onnx_initializer_1",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 3
    },
    {
      "bottom" : "84,initializers.onnx_initializer_1",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "85",
      "top" : "85",
      "type" : "elementwise",
      "name" : "85",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.4",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "107",
      "blob_weights" : 7,
      "K" : 3,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "input.4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "85",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.8",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "129",
      "blob_weights" : 11,
      "K" : 16,
      "blob_biases" : 9,
      "name" : "input.8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "107",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.12",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "150",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "name" : "input.12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "129",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.16",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "173",
      "blob_weights" : 19,
      "K" : 16,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "input.16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "150",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.20",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "194",
      "blob_weights" : 23,
      "K" : 16,
      "blob_biases" : 21,
      "name" : "input.20",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "173",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.24",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "216",
      "blob_weights" : 27,
      "K" : 32,
      "blob_biases" : 25,
      "name" : "input.24",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "194",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.28",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "237",
      "blob_weights" : 31,
      "K" : 32,
      "blob_biases" : 29,
      "name" : "input.28",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "216",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.32",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "260",
      "blob_weights" : 35,
      "K" : 32,
      "blob_biases" : 33,
      "stride_x" : 2,
      "name" : "input.32",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "237",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.36",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "281",
      "blob_weights" : 39,
      "K" : 32,
      "blob_biases" : 37,
      "name" : "input.36",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "260",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.40",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "303",
      "blob_weights" : 43,
      "K" : 64,
      "blob_biases" : 41,
      "name" : "input.40",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "281",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.44",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "324",
      "blob_weights" : 47,
      "K" : 64,
      "blob_biases" : 45,
      "name" : "input.44",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "303",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.48",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "347",
      "blob_weights" : 51,
      "K" : 64,
      "blob_biases" : 49,
      "stride_x" : 2,
      "name" : "input.48",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "324",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.52",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "368",
      "blob_weights" : 55,
      "K" : 64,
      "blob_biases" : 53,
      "name" : "input.52",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "347",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.56",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "390",
      "blob_weights" : 59,
      "K" : 128,
      "blob_biases" : 57,
      "name" : "input.56",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "368",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.60",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "411",
      "blob_weights" : 63,
      "K" : 128,
      "blob_biases" : 61,
      "name" : "input.60",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "390",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.64",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "433",
      "blob_weights" : 67,
      "K" : 128,
      "blob_biases" : 65,
      "name" : "input.64",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "411",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.68",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "454",
      "blob_weights" : 71,
      "K" : 128,
      "blob_biases" : 69,
      "name" : "input.68",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "433",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.72",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "476",
      "blob_weights" : 75,
      "K" : 128,
      "blob_biases" : 73,
      "name" : "input.72",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "454",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.76",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "497",
      "blob_weights" : 79,
      "K" : 128,
      "blob_biases" : 77,
      "name" : "input.76",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "476",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.80",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "519",
      "blob_weights" : 83,
      "K" : 128,
      "blob_biases" : 81,
      "name" : "input.80",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "497",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.84",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "540",
      "blob_weights" : 87,
      "K" : 128,
      "blob_biases" : 85,
      "name" : "input.84",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "519",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.88",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "562",
      "blob_weights" : 91,
      "K" : 128,
      "blob_biases" : 89,
      "name" : "input.88",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "540",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.92",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "583",
      "blob_weights" : 95,
      "K" : 128,
      "blob_biases" : 93,
      "name" : "input.92",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "562",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.96",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "606",
      "blob_weights" : 99,
      "K" : 128,
      "blob_biases" : 97,
      "stride_x" : 2,
      "name" : "input.96",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "583",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.100",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "627",
      "blob_weights" : 103,
      "K" : 128,
      "blob_biases" : 101,
      "name" : "input.100",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "606",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.104",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "648",
      "blob_weights" : 107,
      "K" : 256,
      "blob_biases" : 105,
      "name" : "input.104",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "627",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.106",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 3,
      "is_global" : 1,
      "top" : "input.106",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.106",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "648",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 3,
      "pad_value" : 0
    },
    {
      "name" : "657",
      "weights" : {

      },
      "dst_w" : 128,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "input.106",
      "debug_info" : "657",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "657"
    },
    {
      "nB" : 128,
      "top" : "linear_0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 3,
      "blob_weights" : 111,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "657",
      "blob_biases" : 109,
      "has_tanh" : 0,
      "debug_info" : "linear_0",
      "name" : "linear_0",
      "has_prelu" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.110",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "723",
      "blob_weights" : 115,
      "K" : 128,
      "blob_biases" : 113,
      "name" : "input.110",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.106",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.112",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "is_global" : 1,
      "top" : "input.112",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.112",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "723",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "732",
      "weights" : {

      },
      "dst_w" : 128,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "input.112",
      "debug_info" : "732",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "732"
    },
    {
      "nB" : 128,
      "top" : "linear_1",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 10,
      "blob_weights" : 119,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "732",
      "blob_biases" : 117,
      "has_tanh" : 0,
      "debug_info" : "linear_1",
      "name" : "linear_1",
      "has_prelu" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.116",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "798",
      "blob_weights" : 123,
      "K" : 128,
      "blob_biases" : 121,
      "name" : "input.116",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.112",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "is_global" : 1,
      "top" : "input.1",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.1",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "798",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "807",
      "weights" : {

      },
      "dst_w" : 128,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "input.1",
      "debug_info" : "807",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "807"
    },
    {
      "nB" : 128,
      "top" : "linear_2",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 5,
      "blob_weights" : 127,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "807",
      "blob_biases" : 125,
      "has_tanh" : 0,
      "debug_info" : "linear_2",
      "name" : "linear_2",
      "has_prelu" : 0
    },
    {
      "bottom" : "linear_0,linear_1,linear_2",
      "weights" : {

      },
      "nd_mode" : true,
      "debug_info" : "855",
      "axis" : 1,
      "top" : "var_855",
      "type" : "general_concat",
      "name" : "855",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}