{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "92",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "input.2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input_1_1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.4",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "105",
      "blob_weights" : 7,
      "K" : 16,
      "blob_biases" : 5,
      "name" : "input.4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "92",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "117",
      "blob_weights" : 11,
      "K" : 16,
      "blob_biases" : 9,
      "name" : "input.6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "105",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.8",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "131",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "input.8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "117",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.10",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "143",
      "blob_weights" : 19,
      "K" : 16,
      "blob_biases" : 17,
      "name" : "input.10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "131",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.12",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "156",
      "blob_weights" : 23,
      "K" : 40,
      "blob_biases" : 21,
      "name" : "input.12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 40,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "143",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.14",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "168",
      "blob_weights" : 27,
      "K" : 40,
      "blob_biases" : 25,
      "name" : "input.14",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "156",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.16",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "182",
      "blob_weights" : 31,
      "K" : 40,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "input.16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 40,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "168",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.18",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "194",
      "blob_weights" : 35,
      "K" : 40,
      "blob_biases" : 33,
      "name" : "input.18",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "182",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.20",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "207",
      "blob_weights" : 39,
      "K" : 72,
      "blob_biases" : 37,
      "name" : "input.20",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "194",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.22",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "219",
      "blob_weights" : 43,
      "K" : 72,
      "blob_biases" : 41,
      "name" : "input.22",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "207",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.24",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "232",
      "blob_weights" : 47,
      "K" : 72,
      "blob_biases" : 45,
      "name" : "input.24",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "219",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.26",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "244",
      "blob_weights" : 51,
      "K" : 72,
      "blob_biases" : 49,
      "name" : "input.26",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "232",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.28",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "258",
      "blob_weights" : 55,
      "K" : 72,
      "blob_biases" : 53,
      "stride_x" : 2,
      "name" : "input.28",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "244",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.30",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "270",
      "blob_weights" : 59,
      "K" : 72,
      "blob_biases" : 57,
      "name" : "input.30",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "258",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.32",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "283",
      "blob_weights" : 63,
      "K" : 152,
      "blob_biases" : 61,
      "name" : "input.32",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "270",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.34",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "295",
      "blob_weights" : 67,
      "K" : 152,
      "blob_biases" : 65,
      "name" : "input.34",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "283",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.36",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "309",
      "blob_weights" : 71,
      "K" : 152,
      "blob_biases" : 69,
      "stride_x" : 2,
      "name" : "input.36",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 152,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 152,
      "bottom" : "295",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.38",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "321",
      "blob_weights" : 75,
      "K" : 152,
      "blob_biases" : 73,
      "name" : "input.38",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "309",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.40",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "334",
      "blob_weights" : 79,
      "K" : 288,
      "blob_biases" : 77,
      "name" : "input.40",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "321",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.42",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "346",
      "blob_weights" : 83,
      "K" : 288,
      "blob_biases" : 81,
      "name" : "input.42",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "334",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.44",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "359",
      "blob_weights" : 87,
      "K" : 288,
      "blob_biases" : 85,
      "name" : "input.44",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "346",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.46",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "371",
      "blob_weights" : 91,
      "K" : 288,
      "blob_biases" : 89,
      "name" : "input.46",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "359",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.48",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "384",
      "blob_weights" : 95,
      "K" : 288,
      "blob_biases" : 93,
      "name" : "input.48",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "371",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.50",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "396",
      "blob_weights" : 99,
      "K" : 288,
      "blob_biases" : 97,
      "name" : "input.50",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "384",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.52",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "409",
      "blob_weights" : 103,
      "K" : 288,
      "blob_biases" : 101,
      "name" : "input.52",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "396",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.54",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "421",
      "blob_weights" : 107,
      "K" : 288,
      "blob_biases" : 105,
      "name" : "input.54",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "409",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.56",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "434",
      "blob_weights" : 111,
      "K" : 288,
      "blob_biases" : 109,
      "name" : "input.56",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "421",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.58",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "446",
      "blob_weights" : 115,
      "K" : 288,
      "blob_biases" : 113,
      "name" : "input.58",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "434",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "first.2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "first.2",
      "blob_weights" : 119,
      "K" : 72,
      "blob_biases" : 117,
      "name" : "first.2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "244",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "first.4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "first.4",
      "blob_weights" : 123,
      "K" : 152,
      "blob_biases" : 121,
      "name" : "first.4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "295",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input_tensor.2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input_tensor.2",
      "blob_weights" : 127,
      "K" : 288,
      "blob_biases" : 125,
      "name" : "input_tensor.2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "446",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "top" : "second.2",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "input_tensor.2",
      "debug_info" : "second.2",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "second.2",
      "scaling_factor_y" : 2
    },
    {
      "bottom" : "first.4,second.2",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "485",
      "top" : "485",
      "type" : "elementwise",
      "name" : "485",
      "beta" : 0
    },
    {
      "top" : "second.4",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "485",
      "debug_info" : "second.4",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "second.4",
      "scaling_factor_y" : 2
    },
    {
      "bottom" : "first.2,second.4",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "491",
      "top" : "491",
      "type" : "elementwise",
      "name" : "491",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.60",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.60",
      "blob_weights" : 131,
      "K" : 16,
      "blob_biases" : 129,
      "name" : "input.60",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "491",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "first.6",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "first.6",
      "blob_weights" : 135,
      "K" : 16,
      "blob_biases" : 133,
      "name" : "first.6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "485",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "first.1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "first.1",
      "blob_weights" : 139,
      "K" : 16,
      "blob_biases" : 137,
      "name" : "first.1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input_tensor.2",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "second.6",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "second.6",
      "blob_weights" : 143,
      "K" : 16,
      "blob_biases" : 141,
      "stride_x" : 2,
      "name" : "second.6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.60",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "first.6,second.6",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "538",
      "top" : "538",
      "type" : "elementwise",
      "name" : "538",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "second.1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "second.1",
      "blob_weights" : 147,
      "K" : 16,
      "blob_biases" : 145,
      "stride_x" : 2,
      "name" : "second.1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "538",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "first.1,second.1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "552",
      "top" : "552",
      "type" : "elementwise",
      "name" : "552",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.62",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.62",
      "blob_weights" : 151,
      "K" : 16,
      "blob_biases" : 149,
      "name" : "input.62",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "538",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.64",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.64",
      "blob_weights" : 155,
      "K" : 16,
      "blob_biases" : 153,
      "name" : "input.64",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "552",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.66",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "587",
      "blob_weights" : 159,
      "K" : 16,
      "blob_biases" : 157,
      "name" : "input.66",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.60",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.68",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "599",
      "blob_weights" : 163,
      "K" : 16,
      "blob_biases" : 161,
      "name" : "input.68",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "587",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.70",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "612",
      "blob_weights" : 167,
      "K" : 64,
      "blob_biases" : 165,
      "name" : "input.70",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "599",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.72",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "624",
      "blob_weights" : 171,
      "K" : 64,
      "blob_biases" : 169,
      "name" : "input.72",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "612",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input_tensor.4",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input_tensor.4",
      "blob_weights" : 175,
      "K" : 64,
      "blob_biases" : 173,
      "name" : "input_tensor.4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 2,
      "bottom" : "624",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input_tensor.6",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input_tensor.6",
      "blob_weights" : 179,
      "K" : 64,
      "blob_biases" : 177,
      "name" : "input_tensor.6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "624",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input_tensor.8",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input_tensor.8",
      "blob_weights" : 183,
      "K" : 64,
      "blob_biases" : 181,
      "name" : "input_tensor.8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "624",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "input_tensor.4",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_8",
      "top" : "transpose_8",
      "type" : "transpose",
      "name" : "transpose_8"
    },
    {
      "name" : "input.74",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "transpose_8",
      "debug_info" : "input.74",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "input.74"
    },
    {
      "bottom" : "input.74",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "674",
      "top" : "var_674",
      "type" : "activation",
      "name" : "674",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "input_tensor.6",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_7",
      "top" : "transpose_7",
      "type" : "transpose",
      "name" : "transpose_7"
    },
    {
      "name" : "690",
      "weights" : {

      },
      "dst_w" : 4,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "dynamic_shape" : false,
      "bottom" : "transpose_7",
      "debug_info" : "690",
      "dst_k" : 1,
      "dst_seq" : 1,
      "top" : "var_690"
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "input_tensor.8",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_6",
      "top" : "transpose_6",
      "type" : "transpose",
      "name" : "transpose_6"
    },
    {
      "name" : "706",
      "weights" : {

      },
      "dst_w" : 10,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "dynamic_shape" : false,
      "bottom" : "transpose_6",
      "debug_info" : "706",
      "dst_k" : 1,
      "dst_seq" : 1,
      "top" : "var_706"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.76",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "719",
      "blob_weights" : 187,
      "K" : 16,
      "blob_biases" : 185,
      "name" : "input.76",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.62",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.78",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "731",
      "blob_weights" : 191,
      "K" : 16,
      "blob_biases" : 189,
      "name" : "input.78",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "719",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.80",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "744",
      "blob_weights" : 195,
      "K" : 64,
      "blob_biases" : 193,
      "name" : "input.80",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "731",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.82",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "756",
      "blob_weights" : 199,
      "K" : 64,
      "blob_biases" : 197,
      "name" : "input.82",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "744",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input_tensor.16",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input_tensor.16",
      "blob_weights" : 203,
      "K" : 64,
      "blob_biases" : 201,
      "name" : "input_tensor.16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 2,
      "bottom" : "756",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input_tensor.18",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input_tensor.18",
      "blob_weights" : 207,
      "K" : 64,
      "blob_biases" : 205,
      "name" : "input_tensor.18",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "756",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input_tensor.20",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input_tensor.20",
      "blob_weights" : 211,
      "K" : 64,
      "blob_biases" : 209,
      "name" : "input_tensor.20",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "756",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "input_tensor.16",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_5",
      "top" : "transpose_5",
      "type" : "transpose",
      "name" : "transpose_5"
    },
    {
      "name" : "input.84",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "transpose_5",
      "debug_info" : "input.84",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "input.84"
    },
    {
      "bottom" : "input.84",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "806",
      "top" : "var_806",
      "type" : "activation",
      "name" : "806",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "input_tensor.18",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_4",
      "top" : "transpose_4",
      "type" : "transpose",
      "name" : "transpose_4"
    },
    {
      "name" : "822",
      "weights" : {

      },
      "dst_w" : 4,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "dynamic_shape" : false,
      "bottom" : "transpose_4",
      "debug_info" : "822",
      "dst_k" : 1,
      "dst_seq" : 1,
      "top" : "var_822"
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "input_tensor.20",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_3",
      "top" : "transpose_3",
      "type" : "transpose",
      "name" : "transpose_3"
    },
    {
      "name" : "838",
      "weights" : {

      },
      "dst_w" : 10,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "dynamic_shape" : false,
      "bottom" : "transpose_3",
      "debug_info" : "838",
      "dst_k" : 1,
      "dst_seq" : 1,
      "top" : "var_838"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.86",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "851",
      "blob_weights" : 215,
      "K" : 16,
      "blob_biases" : 213,
      "name" : "input.86",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.64",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.88",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "863",
      "blob_weights" : 219,
      "K" : 16,
      "blob_biases" : 217,
      "name" : "input.88",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "851",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.90",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "876",
      "blob_weights" : 223,
      "K" : 64,
      "blob_biases" : 221,
      "name" : "input.90",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "863",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.92",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "888",
      "blob_weights" : 227,
      "K" : 64,
      "blob_biases" : 225,
      "name" : "input.92",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "876",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input_tensor.28",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input_tensor.28",
      "blob_weights" : 231,
      "K" : 64,
      "blob_biases" : 229,
      "name" : "input_tensor.28",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 2,
      "bottom" : "888",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input_tensor.30",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input_tensor.30",
      "blob_weights" : 235,
      "K" : 64,
      "blob_biases" : 233,
      "name" : "input_tensor.30",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "888",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input_tensor.32",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input_tensor.32",
      "blob_weights" : 239,
      "K" : 64,
      "blob_biases" : 237,
      "name" : "input_tensor.32",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "888",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "input_tensor.28",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_2",
      "top" : "transpose_2",
      "type" : "transpose",
      "name" : "transpose_2"
    },
    {
      "name" : "input.1",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "transpose_2",
      "debug_info" : "input.1",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "input.1"
    },
    {
      "bottom" : "input.1",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "938",
      "top" : "var_938",
      "type" : "activation",
      "name" : "938",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "input_tensor.30",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_1",
      "top" : "transpose_1",
      "type" : "transpose",
      "name" : "transpose_1"
    },
    {
      "name" : "954",
      "weights" : {

      },
      "dst_w" : 4,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "dynamic_shape" : false,
      "bottom" : "transpose_1",
      "debug_info" : "954",
      "dst_k" : 1,
      "dst_seq" : 1,
      "top" : "var_954"
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "input_tensor.32",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_0",
      "top" : "transpose_0",
      "type" : "transpose",
      "name" : "transpose_0"
    },
    {
      "name" : "970",
      "weights" : {

      },
      "dst_w" : 10,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "dynamic_shape" : false,
      "bottom" : "transpose_0",
      "debug_info" : "970",
      "dst_k" : 1,
      "dst_seq" : 1,
      "top" : "var_970"
    }
  ]
}